-- 
-- TABLESAMPLE
--


-- 100万行のテーブル
drop table if exists data01;
create table data01(
    id serial primary key, 
    val NUMERIC
); 
insert into data01 select i, random() from generate_series(1, 1000000) as gs(i);
\timing

-- ブロックサイズ
show block_size;
/*
 block_size 
------------
 8192
(1 row)
*/

-- ブロックあたりのタプル件数
select 1000000 / (pg_relation_size('data01') / 8192);
/*
 ?column? 
----------
      184
(1 row)
*/

-- １パーセント(10000件)のレコードを取得する。

-- systemサンプリングメソッドを使う
-- 高速だが、ブロック上で連続したレコードが取得される
select * from data01 tablesample system(1)
;
/*
   id   |          val          
--------+-----------------------
  44756 |     0.261814157944173
  44757 |     0.388898339588195
  44758 |     0.582481688819826
  44759 |     0.227174829225987
  44760 |     0.604652336332947
  44761 |     0.125560171436518
：
Time: 5.474 ms
*/

-- 取得件数のバラつきが大きい
select count(*) from data01 tablesample system(1)
;
/*
 count 
-------
  9619
(1 row)

-------
 10725
-------
 11836
-------
 10168

*/

-- 指定件数がブロックあたりのタプル数を下回ると０件の取得となる
-- 0.01パーセント（100件）を指定
select * from data01 tablesample system(0.01)
;
/*
 id | val 
----+-----
(0 rows)
*/

-- bernoulli サンプリングメソッドを使う
-- 完全にランダムな抽出だが、system より遅くなる
select * from data01 tablesample bernoulli(1)
;
/*
   id   |          val          
--------+-----------------------
 316653 |     0.401423054281622
 316680 |    0.0159771158359945
 316687 |     0.831002838909626
 316694 |     0.264458292163908
 316722 |     0.756147774402052
 316770 |     0.775258988607675
 316798 |     0.874730023089796
 316831 |     0.636967135127634
 317004 |     0.985737877897918
 317094 |     0.571683696471155
 317114 |      0.60787337878719
:

Time: 18.636 ms
*/

-- 取得件数のバラつきは統計的に妥当なもの
select count(*) from data01 tablesample bernoulli(1)
;
/*
 count 
-------
  9985
(1 row)

-------
  9866
-------
 10008
-------
 10065
*/

-- 少数の標本を指定してもちゃんと取得される
-- 0.001パーセント（10件）取得してみる
select * from data01 tablesample bernoulli(0.001)
;
/*
   id   |        val         
--------+--------------------
 327791 |  0.593450671993196
 415261 |  0.902073966804892
 482536 |  0.968917656689882
 522537 |  0.367301813326776
 537334 |  0.102183604147285
 594533 |  0.106381460092962
 702501 |  0.730159506667405
 893786 |  0.865281055215746
 894614 |  0.141856135800481
 914450 | 0.0816126330755651
  37920 | 0.0896991994231939
(11 rows)
*/

-- 後始末
\timing
drop table if exists data01;
