--
-- 再帰クエリ
-- 共通テーブル式（CTE）を使った再帰
-- 


-- 再帰クエリで連番を生成する。
with recursive
seq(n) as (
  select 1
  union all
  select n + 1 from seq -- 自己参照
)
select * from seq limit 100 -- 出力行数の制限
;
/*
  n  
-----
   1
   2
   3
   4
   5
   6
   7
   8
   9
  10
  11
  12
  13
  14
  15
  16
  17
  18
  19
  20
  21
  22
  23
  24
  25
  26
  27
  28
  29
  30
  31
  32
  33
  34
  35
  36
  37
  38
  39
  40
  41
  42
  43
  44
  45
  46
  47
  48
  49
  50
  51
  52
  53
  54
  55
  56
  57
  58
  59
  60
  61
  62
  63
  64
  65
  66
  67
  68
  69
  70
  71
  72
  73
  74
  75
  76
  77
  78
  79
  80
  81
  82
  83
  84
  85
  86
  87
  88
  89
  90
  91
  92
  93
  94
  95
  96
  97
  98
  99
 100
(100 rows)
*/

-- 再帰クエリを終了させるには、最終的に0行の追加となる終了条件を設定する。
with recursive
seq(n) as (
  select 1
  union all
  select n + 1 from seq
  where n <= 100      -- 正しい終了条件
)
select * from seq
;

-- 無限ループ
/*
with recursive
seq(n) as (
  select 1
  union all
  select n + 1 from seq
)
select * from seq where n <= 100
;
*/

-- 行を増殖させる再帰クエリ
with recursive
bin(s) as (
  select ''
  union all
  -- クロス結合により生成行数が２倍になる
  select s || b from bin, (values(0), (1)) as b(b)
)
select s from bin limit 100
;
/*
   s    
--------
 
 0
 1
 00
 01
 10
 11
 000
 001
 010
 011
 100
 101
 110
 111
 0000
 0001
 0010
 0011
 0100
 0101
 0110
 0111
 1000
 1001
 1010
 1011
 1100
 1101
 1110
 1111
 00000
 00001
 00010
 00011
 00100
 00101
 00110
 00111
 01000
 01001
 01010
 01011
 01100
 01101
 01110
 01111
 10000
 10001
 10010
 10011
 10100
 10101
 10110
 10111
 11000
 11001
 11010
 11011
 11100
 11101
 11110
 11111
 000000
 000001
 000010
 000011
 000100
 000101
 000110
 000111
 001000
 001001
 001010
 001011
 001100
 001101
 001110
 001111
 010000
 010001
 010010
 010011
 010100
 010101
 010110
 010111
 011000
 011001
 011010
 011011
 011100
 011101
 011110
 011111
 100000
 100001
 100010
 100011
 100100
(100 rows)
*/


-- 階乗
with recursive
fact as (
  select 1 as n, 1::numeric as f
  union all
  select n+1, f * (n+1) from fact
)
select * from fact limit 20
;
/*
 n  |          f          
----+---------------------
  1 |                   1
  2 |                   2
  3 |                   6
  4 |                  24
  5 |                 120
  6 |                 720
  7 |                5040
  8 |               40320
  9 |              362880
 10 |             3628800
 11 |            39916800
 12 |           479001600
 13 |          6227020800
 14 |         87178291200
 15 |       1307674368000
 16 |      20922789888000
 17 |     355687428096000
 18 |    6402373705728000
 19 |  121645100408832000
 20 | 2432902008176640000
(20 rows)
*/